
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * module.redis-cache.azurerm_private_endpoint.this[0]
* Update
  * azurerm_key_vault_secret.redis_connection_string
* Replace
  * module.redis-cache.azurerm_redis_cache.redis
  * module.redis-cache.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_connection_string" {
      - content_type            = "" -> null
        id                      = "https://div-aat.vault.azure.net/secrets/pfe-redis-connection-string/d302c4a923ed4d5aa5b4858e9be8a7f6"
        name                    = "pfe-redis-connection-string"
        tags                    = {}
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redis-cache.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "div-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "div-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/div-petitioner-frontend.git"
          + "application"         = "divorce"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#div-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Divorce"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "div-aat"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis-cache.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ hostname                      = "div-redis-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Cache/Redis/div-redis-aat" -> (known after apply)
      ~ name                          = "div-redis-aat" -> "div-pfe-aat" # forces replacement
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0.14" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ resource_group_name           = "div-redis-cache-aat" -> "div-cache-aat" # forces replacement
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/div-petitioner-frontend.git"
            "application"         = "divorce"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#div-dev"
            "environment"         = "staging"
            "managedBy"           = "Divorce"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }

      - timeouts {}
    }

  # module.redis-cache.azurerm_resource_group.cache-resourcegroup[0] must be replaced
-/+ resource "azurerm_resource_group" "cache-resourcegroup" {
      ~ id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat" -> (known after apply)
      ~ name     = "div-redis-cache-aat" -> "div-cache-aat" # forces replacement
        tags     = {
            "BuiltFrom"           = "https://github.com/HMCTS/div-petitioner-frontend.git"
            "application"         = "divorce"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#div-dev"
            "environment"         = "staging"
            "managedBy"           = "Divorce"
        }
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1111,"Program":"tfcmt","SHA1":"","Vars":{}} -->